1.Create a dataframe with 4 columns 4 rows

In [28]:
import pandas as pd
a=[[1,2,3,4],[4,5,6,7],[7,8,9,10],[11,12,13,14]]
k=pd.DataFrame(a,index=["r1","r2","r3","r4"],columns=["c1","c2","c3","c4"])
k

    c1  c2  c3  c4
r1   1   2   3   4
r2   4   5   6   7
r3   7   8   9  10
r4  11  12  13  14

2.print all Columns form your data frame

In [11]:
k.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

3.print all rows from your data frame

In [29]:
for i in k.iterrows():
    print(i)

('r1', c1    1
c2    2
c3    3
c4    4
Name: r1, dtype: int64)
('r2', c1    4
c2    5
c3    6
c4    7
Name: r2, dtype: int64)
('r3', c1     7
c2     8
c3     9
c4    10
Name: r3, dtype: int64)
('r4', c1    11
c2    12
c3    13
c4    14
Name: r4, dtype: int64)

4.print Second  column in your data frame

In [30]:
k["c2"]

r1     2
r2     5
r3     8
r4    12
Name: c2, dtype: int64

5.print last 2 columns from your data Frame

In [37]:
k.loc[:,"c3":]

    c3  c4
r1   3   4
r2   6   7
r3   9  10
r4  13  14

6.print fourth row from your data Frame

In [38]:
k.loc["r4":]

    c1  c2  c3  c4
r4  11  12  13  14

7.print first 2 Rows from your data Frame

In [54]:
k.loc[:"r2","c1":]

    c1  c2  c3  c4
r1   1   2   3   4
r2   4   5   6   7

8.print all rows and first 2 columns from your data Frame

In [64]:
k.loc["r1":,:"c2":]

    c1  c2
r1   1   2
r2   4   5
r3   7   8
r4  11  12

9.Delete any row from your data Frame

In [70]:
k.drop("r4")

    c1  c2  c3  c4
r1   1   2   3   4
r2   4   5   6   7
r3   7   8   9  10

10.Delete any column from your data Frame

In [75]:
k.pop("c3","c4")

    c1  c2
r1   1   2
r2   4   5
r3   7   8
r4  11  12

11.Add a column to a Data Frame

In [80]:
column=["4","5","0","4"]
k["c5"]=column
k

    c1  c2 c3 c5
r1   1   2  4  4
r2   4   5  5  5
r3   7   8  0  0
r4  11  12  4  4

In [81]:
k

    c1  c2 c3 c5
r1   1   2  4  4
r2   4   5  5  5
r3   7   8  0  0
r4  11  12  4  4

12.Add a Row to Data Frame

13.Iterate all Columns  in your Data Frame and print result

In [82]:
for i in k:
    print(i)

c1
c2
c3
c5

14.Iterate the 3rd column values  of your Data frame and print result.

In [84]:
k.pop("c1")
for i in k:
    print(i)

c2
c3
c5

15.Iterate all Rows  in your Data Frame and print result.

In [85]:
for i in k.iterrows():
    print(i)

('r1', c2    2
c3    4
c5    4
Name: r1, dtype: object)
('r2', c2    5
c3    5
c5    5
Name: r2, dtype: object)
('r3', c2    8
c3    0
c5    0
Name: r3, dtype: object)
('r4', c2    12
c3     4
c5     4
Name: r4, dtype: object)

16.Read income.csv  file and print as Data Frame

In [88]:
a="income_csv"
k=pd.read_csv(a)
k

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528